<%@ LANGUAGE = "JScript"%> 
<!-- #INCLUDE FILE="Include/html.inc" -->
<% Html.SetHead("Важливо") %>

<STYLE>	OL {text-align: left; font-size: 1em; margin: auto; padding: 0.5em 1em 1em 2em;}
	LI {text-align: justify;}
	HR {width: 90px; color: #FFFFFF; margin: auto;}
</STYLE>

<BODY CLASS="ContainerStart">
	<H4 STYLE="color: #FF0000; margin:auto;">&#9888;Важливо<HR></H4>
	<OL><LI>Для роботи в CORSAR не обов'язково мати інтернет&#10071;Поки ми в одній мережі з Кіровоградобленерго краще заходити з адреси <a class="mainmenu" href="http://10.103.170.7/business/">http://10.103.170.7/business/</a>.
	Сесія автоматично припиняється після <b>20 хвилин</b> бездіяльністі користувача. Працюйте у вкладках (права кнопка миші - відкрити посилання на новій вкладці)&#10071; Можна відкрити, наприклад, вкладки для пошуку споживачів, договорів, точок і там здійснювати пошук,
	а працювати в окремій вкладці. Тоді не буде необхідності "бігати по меню" - просто перемикайтесь між вкладками. Перехід між вкладками - Ctrl+Tab, виділити - Ctrl+A, скопіювати - Ctrl+C, вставити - Ctrl+V, пошук - Ctrl+F, перехід між полями - Tab.
	В самому браузері є можливість збільшувати або зменшувати масштаб зображення, рекомендую скористатися, якщо є необхідність. <b>Використовуйте Google Chrome або Microsoft Edge Chromium.</b></LI>
	<LI>Необхідно перевірити анкети споживачів (коди, назви, адреса, керівники, контакти ...) та відредагувати якщо необхідно. Список анкет споживачів, які не конвертовані <A CLASS="InfoLink" HREF="./temp/customerlist.htm" TARGET="_blank">тут</A>.</LI>
	<LI>Необхідно відредагувати кожну анкету договору (доступно тільки користувачу з ролью 'технік'). Для отримання всього списку договорів ЦОС необхідно при пошуку договора в полі 'Рахунок' поставити перші 2 цифри (код ЦОС):
	Благовіщенський-01, Бобринецький-02, Вільшанський-03, Гайворонський-04, Голованівський-05, Добровеличківський-06, Долинський-07, Знам'янський-08, Компаніївський-09, Кропивницький-10, Маловисківський-11,
	Новгородківський-12, Новоархангельський-13, Новомиргородський-14, Новоукраїнський-15, Олександрівський-16, Олександрійський-17, Онуфріївський-18, Петрівський-19, Світловодський-20.
	<b>Дозволяється в одному договорі мати точки різних операторів.</b></LI>
	<LI>Необхідно перевірити точки продажу. Меню `Звіти-Точки`. На етапі налаштування системи анкети споживачів, договорів, точок  краще не видаляти, а редагувати. Видалене можна відновити, а потім відредагувати. Найкраще - працювати без видаленого
	(тому що воно лежить як сміття у корзині і не працює, тільки місце займає).</LI>
	<LI>Працівник центрального офісу з ранку імпортує в систему оплату споживачів за останній банківський день. Бухгалтер ЦОС повинен проконтролювати та відредагувати <b>період за який здійснюється оплата</b> при потребі та занести необхідні операції в ручному режимі.
	Забороняється вносити оплату вручну до імпорту оплат&#9940; Оплата ПрАТ 'Кіровоградобленерго', банків та Укрпошти не імпортується (вони масово здійснюють оплату від/для інших споживачів). Для тих ЦОС у кого один споживач має декілька договорів і
	одна оплата заноситься на кожний договір - є можливість виключити такого споживача з імпорту оплат.</LI>
	<LI>Імпортовані	залишки &#8372; станом на 01.02.2021. Необхідно перевірити. Меню `Звіти-баланс`, `Договора без залишків`. Залишки &#8372; будуть імпортуватися кожного місяця до запуску системи,
	при цьому <b>попередні залишки будуть видалятися</b>&#10071; По договорам без залишков треба буде руками внести сальдо (оріентовно у квітні 2021 року) або відредагувати (видалити) такі договора.</LI>
	<!--LI>Реалізовано зведений баланс ЦОС. Бухгалтер ЦОС заносить дані в цілому по ЦОС за звітний місяць. Меню `Робота-Зведений баланс`.</LI-->
	<LI>Необхідно занести прогнозні обсяги на 2021 рік. Меню `Робота-Заявки`, `Звіти-Договора без заявок`. Не треба кожного разу для вводу нової заявки йти в меню `Робота-Заявки-Нова заявка`. Просто натискайте на посилання 'Виконано'
	після вдалої операції - це поверне екран до попереднього для вводу нової заявки. Це працює для будь-якої операції (не тільки для заявок).</LI>
	<LI>Відгуки та пропозиції надсилайте мені &#128231;, або по &#9742;. Формулюйте чітко і ясно, будь-ласка&#128578;
	<b>Консолідація</b> - процедура, яка підраховує сумарні фактичні нарахування та оплату по всім договорам у звітньому місяці (<b>для рахунків по факту та сальдовки</b>). Зверніть увагу на нові звіти (для техніка).
	По кожному договору повинна формуватися ціна для податкових накладних. Меню 'Звіти-Договора-Без ціни'&#10071; Ціна, маржа та тариф визначається в <b>копійках</b>&#10071;<!--Ви, взагалі, на екран дивитесь&#10067;&#128545;-->
	Якщо у вас буде ціна 0.0001 коп, то і рахунок буде відповідним і проблеми з податковою інспекцією.</LI>
	<LI>Для договорів з передоплатою та заявками можна формувати і друкувати рахунки на передоплату. Причини по яким рахунок не друкується: 1. не заповнена анкета споживача (адреса); 2. немає залишків по договору (по факту).
	Кому потрібно масово перенести точки з одного договора на інший - звертайтесь. Додано довідник тарифів. Дуже багато анкет споживачів у яких коротка назва співпадає з повною назвою - навіщо нам тоді коротка назва&#10067;
	Повна назва потрібна лише для податкових накладних, для усього іншого - коротка. <B>Застосувати схему</B> - процедура яка робить перерахунок вартості по фактичним обсягам у точках договору за схемою, яка вказана в договорі.</LI>
	<LI>Реалізовано зведений баланс ЦОС. Бухгалтер ЦОС заносить дані в цілому по ЦОС (в розрізі груп) за звітний місяць. Меню `Робота-Зведений баланс`.</LI>
	<LI>Реалізовано попередній перегляд реєстру податкових накладних. Меню 'Звіти-Реєстр накладних'. <B>Дисбаланс</B> - звіт який показує договора з дисбалансом внаслідок округлення при обрахунку ПДВ з оплати.
	При друку актів використовуються анкетні дані споживача (Керівник поле Кого?), в якому немає необхідністі зберігати повністю ПІБ, достатньо ініціалів.</LI>
	<LI>По занесенню оплат, як варіант, пропоную наступне. Відкриваєте в окремій вкладці список усіх договорів і там здійснюєте пошук по назві або номеру договора (Ctrl+F). Копіюєте рахунок та вставляєте у вкладку з новою оплатою.</LI></OL>
</BODY></HTML>